package checkrunner;

class ProductsDB {
	
	private static final int promoCount = 10;
	private static final int promoDiscount = 10; //в процентах
	
	private static final String[][] items = {
		{"0", "3.99", "Кукурузные хлопья", "1"}, 
		{"1", "1.27", "Пакет молока", "1"}, 
		{"2", "1.64", "Сметана", "0"}, 
		{"3", "2.22", "Майонез", "0"}, 
		{"4", "1.99", "Кетчуп", "0"}, 
		{"5", "2.34", "Соевый соус", "0"}, 
		{"6", "1.79", "Чай чёрный", "1"}, 
		{"7", "1.89", "Чай зелёный", "0"}, 
		{"8", "3.04", "Сливочное масло", "0"}, 
		{"9", "1.34", "Пакет кефира", "0"}, 
		{"10", "1.41", "Батон", "0"}, 
		{"11", "0.99", "Хлеб чёрный", "0"}, 
		{"12", "3.29", "Рис длиннозерновой", "1"}, 
		{"13", "3.19", "Яйца куриные", "1"}, 
		{"14", "2.99", "Пельмени", "0"}, 
		{"15", "1.27", "Напиток газированный 0,33л", "0"}, 
		{"16", "1.61", "Напиток газированный 0,5л", "0"}, 
		{"17", "2.19", "Напиток газированный 1л", "0"}, 
		{"18", "2.99", "Напиток газированный 1,5л", "0"}, 
		{"19", "3.49", "Напиток газированный 2л", "1"}, 
		{"20", "1.79", "Палочки кукурузные", "0"}, 
		{"21", "2.99", "Пачка сигарет", "0"}, 
		{"22", "1.99", "Печенье сдобное", "0"}, 
		{"23", "3.99", "Печенье овсяное", "1"}, 
		{"24", "2.45", "Печенье мучное", "0"}, 
		{"25", "2.89", "Мука", "0"}, 
		{"26", "3.49", "Чипсы", "0"}, 
		{"27", "1.45", "Сухарики", "0"}, 
		{"28", "0.89", "Картофель (1 кг)", "1"}, 
		{"29", "1.12", "Шоколадный батончик", "0"}, 
		{"30", "2.24", "Пачка макарон", "1"}, 
		{"31", "4.09", "Сосиски", "0"}, 
		{"32", "2.49", "Вафли", "0"}, 
		{"33", "2.65", "Творог", "0"}, 
		{"34", "1.79", "Конфеты карамельные", "0"}, 
		{"35", "1.87", "Конфеты шоколадные", "0"}, 
		{"36", "3.51", "Шоколад", "0"}, 
		{"37", "1.43", "Сушки", "0"}, 
		{"38", "1.19", "Крупа манная", "1"}, 
		{"39", "0.99", "Овсяные хлопья", "0"}, 
		{"40", "2.99", "Сгущёное молоко", "0"}, 
		{"41", "4.49", "Сыр", "0"}, 
		{"42", "2.34", "Мороженое", "0"}, 
		{"43", "1.99", "Сок томатный", "1"}, 
		{"44", "2.99", "Сок мультифруктовый", "0"}, 
		{"45", "3.14", "Сок апельсиновый", "0"}, 
		{"46", "3.19", "Сок яблочный", "0"}, 
		{"47", "5.46", "Сок гранатовый", "0"}
	};
	
	static double getIdPrice(int id) {
		return Double.parseDouble(items[id][1]);
	}

	static String getIdName(int id) {
		return items[id][2];
	}
	
	static String getIdPromoStatus(int id) {
		return items[id][3];
	}
	
	static int getPromoCount() {
		return promoCount;
	}
	
	static double getPromoDiscountMultiplier() {
		return ((1 - ((double)promoDiscount/100)));
	}
	

}