package checkrunner;

class ProductsDB {
	
	private String[][] itemsDb = {
		{"0", "3.99", "Кукурузные хлопья"}, 
		{"1", "1.27", "Пакет молока"}, 
		{"2", "1.64", "Сметана"}, 
		{"3", "2.22", "Майонез"}, 
		{"4", "1.99", "Кетчуп"}, 
		{"5", "2.34", "Соевый соус"}, 
		{"6", "1.79", "Чай чёрный"}, 
		{"7", "1.89", "Чай зелёный"}, 
		{"8", "3.04", "Сливочное масло"}, 
		{"9", "1.34", "Пакет кефира"}, 
		{"10", "1.41", "Батон"}, 
		{"11", "0.99", "Хлеб чёрный"}, 
		{"12", "3.29", "Рис длиннозерновой"}, 
		{"13", "3.19", "Яйца куриные"}, 
		{"14", "2.99", "Пельмени"}, 
		{"15", "1.27", "Напиток газированный 0,33л"}, 
		{"16", "1.61", "Напиток газированный 0,5л"}, 
		{"17", "2.19", "Напиток газированный 1л"}, 
		{"18", "2.99", "Напиток газированный 1,5л"}, 
		{"19", "3.49", "Напиток газированный 2л"}, 
		{"20", "1.79", "Палочки кукурузные"}, 
		{"21", "2.99", "Пачка сигарет"}, 
		{"22", "1.99", "Печенье сдобное"}, 
		{"23", "3.99", "Печенье овсяное"}, 
		{"24", "2.45", "Печенье мучное"}, 
		{"25", "2.89", "Мука"}, 
		{"26", "3.49", "Чипсы"}, 
		{"27", "1.45", "Сухарики"}, 
		{"28", "0.89", "Картофель (1 кг)"}, 
		{"29", "1.12", "Шоколадный батончик"}, 
		{"30", "2.24", "Пачка макарон"}, 
		{"31", "4.09", "Сосиски"}, 
		{"32", "2.49", "Вафли"}, 
		{"33", "2.65", "Творог"}, 
		{"34", "1.79", "Конфеты карамельные"}, 
		{"35", "1.87", "Конфеты шоколадные"}, 
		{"36", "3.51", "Шоколад"}, 
		{"37", "1.43", "Сушки"}, 
		{"38", "1.19", "Крупа манная"}, 
		{"39", "0.99", "Овсяные хлопья"}, 
		{"40", "2.99", "Сгущёное молоко"}, 
		{"41", "4.49", "Сыр"}, 
		{"42", "2.34", "Мороженое"}, 
		{"43", "1.99", "Сок томатный"}, 
		{"44", "2.99", "Сок мультифруктовый"}, 
		{"45", "3.14", "Сок апельсиновый"}, 
		{"46", "3.19", "Сок яблочный"}, 
		{"47", "5.46", "Сок гранатовый"}
	};
	
	double getIdPrice(int id) {
		return Double.parseDouble(this.itemsDb[id][1]);
	}

	String getIdName(int id) {
		return this.itemsDb[id][2];
	}
	

}